Revit 2025 API
PipeFittingAndAccessoryPressureDropItem Properties
The PipeFittingAndAccessoryPressureDropItem type exposes the following members.
Properties
Name | Description
BeginConnectorIndex |  The index of the begin connector of the flow path
Coefficient |  The coefficient between the begin connector and end connector, Units: (kg/(ft·s²)).
EndConnectorIndex |  The index of the end conector of the flow path
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
VelocityPressure |  The velocity pressure, for converting between coefficient and pressure drop on this flow path. Units: (kg/(ft·s²)).
Top
See Also
Reference
PipeFittingAndAccessoryPressureDropItem Class
Autodesk.Revit.DB.Plumbing Namespace